# SectionNumber Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
MEPNetworkSegmentData..::..SectionNumber Property
MEPNetworkSegmentData Class See Also
---
The section this segment belongs to.
**Namespace:** Autodesk.Revit.DB.Analysis**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2024
# Syntax
C#
---
```text
public int SectionNumber { get; }
```

Visual Basic
---
```text
Public ReadOnly Property SectionNumber As Integer
	Get
```

Visual C++
---
```text
public:
property int SectionNumber {
	int get ();
}
```

# See Also
MEPNetworkSegmentData Class
Autodesk.Revit.DB.Analysis Namespace